app/controllers/appeals_controller.rb

  def index
    @appeal = Appeal.new #test
    @appeals = @parent.appeals.sort{|x,y| x.question_index <=> y.question_index}
    respond_to do |format|
      @context_array = @parent.parents_top_down(:with_me) << "апелляции (#{@appeals.size})"
---
SELECT "appeals".* FROM "appeals" INNER JOIN "events" ON "appeals".event_id = "events".id WHERE (("events".game_id = 2))

  def create
    @appeal = Appeal.new(params[:appeal])
    respond_to do |format|
      format.html {
        if @appeal.save
---
INSERT INTO "appeals" ("goal", "created_at", "event_id", "question_index", "updated_at", "argument", "answer") VALUES('снятие', '2010-07-13 15:26:01', 1, 19, '2010-07-13 15:26:01', 'Тоже АС', 'Пушкин')

  def update
    respond_to do |format|
      if @appeal.update_attributes(params[:appeal])
---
UPDATE "appeals" SET "updated_at" = '2010-07-13 15:26:19', "goal" = 'зачет', "argument" = 'At the NovaRUG meeting yesterday, Dave Thomas gave a great talk on how the object model works in Ruby. One of his main points was that in Ruby you are always sending a message to an object. If you don''t explicitly say which object you want to send the message to, Ruby sends it to self. In order to make Ruby as clear a language as it is, self changes during the execution of your code. To mentally keep track of what self is, you only need to understand rules of how self changes. There are only 2 things that change what self points to:

  def destroy
    @appeal.destroy
---
DELETE FROM "appeals" WHERE "id" = 1

  def load_appeal_with_parents
    @appeal = Appeal.find(params[:id])
---
SELECT * FROM "appeals" WHERE ("appeals"."id" = 1)