app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT * FROM "cities"

  def show
    @city = City.find(params[:id])
---
SELECT * FROM "cities" WHERE ("cities"."id" = 1)

  def edit
    @city = City.find(params[:id])
---
SELECT * FROM "cities" WHERE ("cities"."id" = 2)

  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES('Кельн', '2010-07-05 17:41:29', '2010-07-05 17:41:29')