app/controllers/disputeds_controller.rb

  def index
    @disputed = Disputed.new
    @disputeds = @parent.disputeds.sort {|x,y| x.question_index <=> y.question_index}
    respond_to do |format|
      @context_array = @parent.parents_top_down(:with_me) << "спорные ответы (#{@disputeds.size})"
---
SELECT "disputeds".* FROM "disputeds" INNER JOIN "events" ON "disputeds".event_id = "events".id WHERE (("events".game_id = 2))

  def create
    @disputed = Disputed.new(params[:disputed])
    respond_to do |format|
      if @disputed.save
---
INSERT INTO "disputeds" ("created_at", "event_id", "question_index", "updated_at", "answer") VALUES('2010-07-13 10:32:57', NULL, 23, '2010-07-13 10:32:57', 'abc')

  def update
    respond_to do |format|
      if @disputed.update_attributes(params[:disputed])
---
UPDATE "disputeds" SET "updated_at" = '2010-07-13 11:50:32', "question_index" = 5 WHERE "id" = 15

  def destroy
    @disputed.destroy
---
DELETE FROM "disputeds" WHERE "id" = 13

  def load_disp_with_parents
    @disputed = Disputed.find(params[:id])
---
SELECT * FROM "disputeds" WHERE ("disputeds"."id" = 14)