app/controllers/disputeds_controller.rb

SELECT * FROM "disputeds" WHERE ("disputeds"."event_id" = 9)
SELECT * FROM "events" WHERE ("events"."id" = 9)
---
  def edit
    @disputed = Disputed.find(params[:id])
    event = Event.find_by_id(@disputed.event_id);

SELECT * FROM "events" WHERE ("events"."id" = 9)
---
  def create
    @disputed = Disputed.new(params[:disputed])
    event = Event.find_by_id(@disputed.event_id);

SELECT * FROM "events" WHERE ("events"."id" = 9)
---
  def update
    @disputed = Disputed.find(params[:id])
    event = Event.find_by_id(@disputed.event_id);

SELECT * FROM "events" WHERE ("events"."id" = 9)
---
  def destroy
    @disputed = Disputed.find(params[:id])
    event = Event.find_by_id(@disputed.event_id);