app/controllers/events_controller.rb

  def index
    @events = @game.events.sort{|x,y|x.city.name <=> y.city.name}
    @context_array = @game.parents_top_down(:with_me) << "все заявки (#{@events.size})"
---
SELECT * FROM "events" WHERE ("events".game_id = 4)

  def create
    params[:event].merge!(:ips => request.remote_ip)
    @event = Event.new(params[:event])

    if (@event.validate_event_date)
      respond_to do |format|
        if @event.save
          format.html { redirect_to(@event, :notice => @event.last_change) }
        else
          format.html {
            @game = Game.find(@event.game_id)
            load_users
            load_cities(@game.tournament_id)
            render :action => "new"
          }
        end
      end
    else
      @game = Game.find(@event.game_id)
---
INSERT INTO "events" ("created_at", "resp_email", "updated_at", "moderator_email", "date", "moderator_name", "resp_name", "city_id", "game_id") VALUES('2010-07-11 14:53:11', '4', '2010-07-11 14:53:11', '2', '2010-07-11', '1', '3', 2, 2)
SELECT * FROM "games" WHERE ("games"."id" = 2)
SELECT * FROM "tournaments" WHERE ("tournaments"."id" = 1)

  def update
    respond_to do |format|
      @event.update_moderator_id params[:event][:moderation_id]
---
UPDATE "events" SET "updated_at" = '2010-07-11 16:33:25', "date" = '2010-07-14', "moderator_name" = '1w' WHERE "id" = 1

  def destroy
    @event.destroy
---
DELETE FROM "events" WHERE "id" = 2

  def load_cities(tournament_id)
    if @game.tournament.every_city
      @cities = City.all(:order => :name)
    else
      @cities = City.find(:all, :joins => :tournaments, :order => :name, :conditions => ["cities_tournaments.tournament_id = ?", tournament_id]).uniq
---
SELECT * FROM "cities"
SELECT "cities".* FROM "cities" INNER JOIN "cities_tournaments" ON "cities_tournaments".city_id = "cities".id INNER JOIN "tournaments" ON "tournaments".id = "cities_tournaments".tournament_id WHERE (cities_tournaments.tournament_id = 1) ORDER BY name DESC
SELECT * FROM "tournaments" WHERE ("tournaments"."id" = 1)

  def find_game
    if params[:game_id]
      @game = Game.find(params[:game_id])
    elsif params[:event] && params[:event][:game_id]
      @game = Game.find(params[:event][:game_id])
---
SELECT * FROM "games" WHERE ("games"."id" = 2)
SELECT * FROM "events" WHERE ("events"."id" = 2)