app/controllers/games_controller.rb

INSERT INTO "games" ("name", "num_questions", "begin", "submit_appeal_until", "created_at", "updated_at", "end", "tournament_id", "num_tours", "submit_results_until", "submit_disp_until") VALUES('2 этап', 15, '2010-07-13', '2010-07-13', '2010-07-13 12:42:06', '2010-07-13 12:42:06', '2010-07-13', 1, 3, '2010-07-13', '2010-07-13')
---
  def create
    @game = Game.new(params[:game])
    respond_to do |format|
      if @game.save

UPDATE "games" SET "end" = '2010-07-20', "updated_at" = '2010-07-14 08:02:44', "submit_appeal_until" = '2010-07-27', "submit_results_until" = '2010-07-30', "submit_disp_until" = '2010-07-24' WHERE "id" = 2
---
  def update
    respond_to do |format|
      [:begin, :end, :game_begin, :game_end, :submit_disp_until, :submit_appeal_until, :submit_results_until].each{|prefix|
        ["(1i)", "(2i)", "(3i)"].each{|suffix|
          params[:game]["#{prefix}#{suffix}"] ||= ""
        }
      }
      if @game.update_attributes(params[:game])

DELETE FROM "games" WHERE "id" = 1
---
  def destroy
    @game.destroy

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 900602800)
SELECT * FROM `games` WHERE (`games`.tournament_id = 900602800)
---
  def find_tournament
    if params[:tournament_id]
      @tournament = Tournament.find params[:tournament_id]
    elsif params[:game] && params[:game][:tournament_id]
      @tournament = Tournament.find params[:game][:tournament_id]