app/controllers/results_controller.rb

  def index
    if @event
      @result = Result.new
      @results = Result.find(:all, :include => [{:team => :city}, :resultitems], :conditions => ["event_id = ?", @event.id]).sort_by{|r| r.local_index }
      #@results = @parent.results.sort_by{|r| r.local_index }
      @results.each {|result| result.calculate_and_save }
      @team = Team.new
      load_teams
      load_cities
    else
      tag = params[:tag]
      tag_id = tag ? Tag.find_by_short_name(tag) : nil
      if tag_id
        results_unsorted = Result.find(:all, :include => [{:team => :city}, :event, :tag, :resultitems], :conditions => ["events.game_id = ? and tag_id = ?", @parent.id, tag_id])
      else
        results_unsorted = Result.find(:all, :include => [{:team => :city}, :event, :resultitems], :conditions => ["events.game_id = ?", @parent.id])
      end
      exclude = params[:exclude]
      if exclude
        exclude_as_array = exclude.split(/,/).map{|element|element.to_i}
        results_unsorted.each do |r|
          r.calculate_excluding(exclude_as_array)
        end
      end
      @results = results_unsorted.sort_by{|r| -r.score }
      calc_performed = @@calculator.calculate_places(@results, tag_id)
      Result.save_multiple(@results) if calc_performed && !tag_id && !exclude
    end
    @context_array = @parent.parents_top_down(:with_me) << "результаты (#{@results.size})"
---
SELECT "results".* FROM "results" INNER JOIN "events" ON "results".event_id = "events".id WHERE (("events".game_id = 2))
SELECT * FROM "cities" WHERE ("cities"."id" = 2)
SELECT * FROM "resultitems" WHERE ("resultitems".result_id = 22)
SELECT * FROM "teams" WHERE ("teams"."id" = 4)
SELECT * FROM "results"
SELECT * FROM "teams" ORDER BY name DESC
SELECT * FROM "events" WHERE ("events"."id" = 44)
SELECT * FROM "games" WHERE ("games"."id" = '2') LIMIT 1
UPDATE "results" SET "updated_at" = '2010-07-18 13:24:42', "score" = 7 WHERE "id" = 29
INSERT INTO "resultitems" ("created_at", "question_index", "updated_at", "result_id", "score") VALUES('2010-07-18 15:24:03', 1, '2010-07-18 15:24:03', 15, 0)

  def create
    @result = Result.new(params[:result])
    @result.score = 0
    @result.cap_name = params[:cap_name] unless params[:cap_name].blank?
    @result.local_index = params[:local_index]
    @result.tag_id = params[:tag_id]

    respond_to do |format|
      if @result.save
        @result.create_resultitems
---
INSERT INTO "results" ("created_at", "event_id", "updated_at", "score", "team_id") VALUES('2010-07-16 17:19:10', 1, '2010-07-16 17:19:10', NULL, 1)
INSERT INTO "resultitems" ("created_at", "question_index", "updated_at", "result_id", "score") VALUES('2010-07-17 09:48:01', 1, '2010-07-17 09:48:01', 29, 0)

  def destroy
    @result.destroy
---
DELETE FROM "results" WHERE "id" = 5

  def load_teams
    @teams_home   = Team.find(:all, :conditions => ["city_id = ?", @event.city_id], :joins => :city, :order => "name ASC")
    @teams_guests = Team.find(:all, :conditions => ["city_id != ?", @event.city_id], :joins => :city, :order => "name ASC")

    @teams_home << Team.new(:name => '--------------------') if !@teams_home.empty?
---
SELECT * FROM "teams"

  def load_result_with_parents
    @result = Result.find(params[:id])
---
SELECT * FROM "results" WHERE ("results"."id" = 5)