app/controllers/resultitems_controller.rb

SELECT * FROM "resultitems" WHERE ("resultitems"."id" = 22)
---
  def show
    @resultitem = Resultitem.find(params[:id])

SELECT * FROM "resultitems" WHERE ("resultitems".result_id = 30)
UPDATE "resultitems" SET "updated_at" = '2010-07-18 07:43:33', "score" = 1 WHERE "id" = 9
UPDATE "results" SET "updated_at" = '2010-07-18 14:52:30', "score" = 4 WHERE "id" = 30
---
  def update
    @resultitem = Resultitem.find(params[:id])
    @resultitem.score =  (params[:checked])
    @resultitem.save