app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)

  def create
    input_for_team = params[:team].except("event_id")
    @team = Team.new(input_for_team)

    respond_to do |format|
      if @team.save
          input_for_result = params[:team].except("name")
          input_for_result["team_id"] = @team.id
          input_for_result["score"] = 0
          @result = Result.new(input_for_result)
          @result.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES('оки', '2010-07-15 17:37:25', '2010-07-15 17:37:25')
INSERT INTO "results" ("created_at", "event_id", "updated_at", "score", "team_id") VALUES('2010-07-15 17:44:54', 44, '2010-07-15 17:44:54', NULL, 4)