app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT * FROM `tournaments`

  def show
    @tournament = Tournament.find(params[:id], :joins => :cities)
---
SELECT * FROM `cities` INNER JOIN `cities_tournaments` ON `cities`.id = `cities_tournaments`.city_id WHERE (`cities_tournaments`.tournament_id = 900602820 )
SELECT `tournaments`.* FROM `tournaments` INNER JOIN `cities_tournaments` ON `cities_tournaments`.tournament_id = `tournaments`.id INNER JOIN `cities` ON `cities`.id = `cities_tournaments`.city_id WHERE (`tournaments`.`id` = 900602801)

  def new
    @tournament = Tournament.new
    @cities = City.all
---
SELECT * FROM `cities` ORDER BY name

  def edit
    @tournament = Tournament.find(params[:id])
    @cities = City.all
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 900602811)
SELECT * FROM `cities` ORDER BY name

  def create
    @tournament = Tournament.new(params[:tournament])

    respond_to do |format|
      if @tournament.save
---
INSERT INTO "tournaments" ("name", "needTeams", "created_at", "updated_at", "org_email", "appeal_for_dismiss") VALUES('КП', 'f', '2010-07-13 12:55:53', '2010-07-13 12:55:53', 'perlinmi@gmail.com', 't')

  def update
    @tournament = Tournament.find(params[:id])

    respond_to do |format|
      if @tournament.update_attributes(params[:tournament])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 900602813)
UPDATE `tournaments` SET `updated_at` = '2011-01-15 00:10:28', `name` = 'Кубок Городов', `appeal_for_dismiss` = 1, `needTeams` = 1 WHERE `id` = 900602813

  def destroy
    @tournament = Tournament.find(params[:id])
    @tournament.destroy
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 242052163)
DELETE FROM `tournaments` WHERE `id` = 242052163